openwch/ch564/EVT/EXAM/SRC/Peripheral/inc/ch564_eth.h
    uint32_t            ETH_TransmitStoreForward;        /* Enables or disables Transmit store and forward mode
                                                             This parameter can be a value of @ref ETH_Transmit_Store_Forward */

    uint32_t            ETH_ForwardErrorFrames;          /* Selects or not the forward to the DMA of erroneous frames
                                                             This parameter can be a value of @ref ETH_Forward_Error_Frames */

    uint32_t            ETH_ForwardUndersizedGoodFrames; /* Enables or disables the Rx FIFO to forward Undersized frames (frames with no Error
                                                             and length less than 64 bytes) including pad-bytes and CRC)
                                                             This parameter can be a value of @ref ETH_Forward_Undersized_Good_Frames */
}ETH_InitTypeDef;

/* ETH delay.Just for Ethernet */
#define _eth_delay_    ETH_Delay       /* Default _eth_delay_ function with less precise timing */

/* definition for Ethernet frame */
#define ETH_MAX_PACKET_SIZE    1536    /* ETH_HEADER + ETH_EXTRA + MAX_ETH_PAYLOAD + ETH_CRC */
#define ETH_HEADER               14    /* 6 byte Dest addr, 6 byte Src addr, 2 byte length/type */
#define ETH_CRC                   4    /* Ethernet CRC */
#define ETH_EXTRA                 2    /* Extra bytes in some cases */
#define VLAN_TAG                  4    /* optional 802.1q VLAN Tag */
#define MIN_ETH_PAYLOAD          46    /* Minimum Ethernet payload size */
#define MAX_ETH_PAYLOAD        1500    /* Maximum Ethernet payload size */
#define JUMBO_FRAME_PAYLOAD    9000    /* Jumbo frame payload size */

/* ETH DMA structure definition */
typedef struct
{
  uint32_t  volatile Status;       /* Status */
  uint32_t  ControlBufferSize;     /* Control and Buffer1, Buffer2 lengths */
  uint32_t  Buffer1Addr;           /* Buffer1 address pointer */
  uint32_t  Buffer2NextDescAddr;   /* Buffer2 or next descriptor address pointer */
} ETH_DMADESCTypeDef;

/**
   DMA Tx Desciptor
  -----------------------------------------------------------------------------------------------
  TDES0 | OWN(31) | CTRL[30:26] | Reserved[25:24] | CTRL[23:20] | Reserved[19:17] | Status[16:0] |
  -----------------------------------------------------------------------------------------------
  TDES1 | Reserved[31:29] | Buffer2 ByteCount[28:16] | Reserved[15:13] | Buffer1 ByteCount[12:0] |
  -----------------------------------------------------------------------------------------------
  TDES2 |                         Buffer1 Address [31:0]                                         |
  -----------------------------------------------------------------------------------------------
  TDES3 |                   Buffer2 Address [31:0] / Next Desciptor Address [31:0]               |
  ------------------------------------------------------------------------------------------------
*/


/* Bit or field definition of TDES0 register (DMA Tx descriptor status register)*/
#define ETH_DMATxDesc_OWN                       ((unsigned int)0x80000000)  /* OWN bit: descriptor is owned by DMA engine */
#define ETH_DMATxDesc_IC                        ((unsigned int)0x40000000)  /* Interrupt on Completion */
#define ETH_DMATxDesc_LS                        ((unsigned int)0x20000000)  /* Last Segment */
#define ETH_DMATxDesc_FS                        ((unsigned int)0x10000000)  /* First Segment */
#define ETH_DMATxDesc_DC                        ((unsigned int)0x08000000)  /* Disable CRC */
#define ETH_DMATxDesc_DP                        ((unsigned int)0x04000000)  /* Disable Padding */
#define ETH_DMATxDesc_TTSE                      ((unsigned int)0x02000000)  /* Transmit Time Stamp Enable */
#define ETH_DMATxDesc_CIC                       ((unsigned int)0x00C00000)  /* Checksum Insertion Control: 4 cases */
#define ETH_DMATxDesc_CIC_ByPass                ((unsigned int)0x00000000)  /* Do Nothing: Checksum Engine is bypassed */
#define ETH_DMATxDesc_CIC_IPV4Header            ((unsigned int)0x00400000)  /* IPV4 header Checksum Insertion */
#define ETH_DMATxDesc_CIC_TCPUDPICMP_Segment    ((unsigned int)0x00800000)  /* TCP/UDP/ICMP Checksum Insertion calculated over segment only */
#define ETH_DMATxDesc_CIC_TCPUDPICMP_Full       ((unsigned int)0x00C00000)  /* TCP/UDP/ICMP Checksum Insertion fully calculated */
#define ETH_DMATxDesc_TER                       ((unsigned int)0x00200000)  /* Transmit End of Ring */
#define ETH_DMATxDesc_TCH                       ((unsigned int)0x00100000)  /* Second Address Chained */
#define ETH_DMATxDesc_TTSS                      ((unsigned int)0x00020000)  /* Tx Time Stamp Status */
#define ETH_DMATxDesc_IHE                       ((unsigned int)0x00010000)  /* IP Header Error */
#define ETH_DMATxDesc_ES                        ((unsigned int)0x00008000)  /* Error summary: OR of the following bits: UE || ED || EC || LCO || NC || LCA || FF || JT */
#define ETH_DMATxDesc_JT                        ((unsigned int)0x00004000)  /* Jabber Timeout */
#define ETH_DMATxDesc_FF                        ((unsigned int)0x00002000)  /* Frame Flushed: DMA/MTL flushed the frame due to SW flush */
#define ETH_DMATxDesc_PCE                       ((unsigned int)0x00001000)  /* Payload Checksum Error */
#define ETH_DMATxDesc_LCA                       ((unsigned int)0x00000800)  /* Loss of Carrier: carrier lost during tramsmission */
#define ETH_DMATxDesc_NC                        ((unsigned int)0x00000400)  /* No Carrier: no carrier signal from the tranceiver */
#define ETH_DMATxDesc_LCO                       ((unsigned int)0x00000200)  /* Late Collision: transmission aborted due to collision */
#define ETH_DMATxDesc_EC                        ((unsigned int)0x00000100)  /* Excessive Collision: transmission aborted after 16 collisions */
#define ETH_DMATxDesc_VF                        ((unsigned int)0x00000080)  /* VLAN Frame */
#define ETH_DMATxDesc_CC                        ((unsigned int)0x00000078)  /* Collision Count */
#define ETH_DMATxDesc_ED                        ((unsigned int)0x00000004)  /* Excessive Deferral */
#define ETH_DMATxDesc_UF                        ((unsigned int)0x00000002)  /* Underflow Error: late data arrival from the memory */
#define ETH_DMATxDesc_DB                        ((unsigned int)0x00000001)  /* Deferred Bit */

