openwch/ch564/EVT/EXAM/SRC/Peripheral/inc/ch564_eth.h
/* Field definition of TDES1 register */
#define ETH_DMATxDesc_TBS2                      ((unsigned int)0x1FFF0000)  /* Transmit Buffer2 Size */
#define ETH_DMATxDesc_TBS1                      ((unsigned int)0x00001FFF)  /* Transmit Buffer1 Size */

/* Field definition of TDES2 register */
#define ETH_DMATxDesc_B1AP                      ((unsigned int)0xFFFFFFFF)  /* Buffer1 Address Pointer */

/* Field definition of TDES3 register */
#define ETH_DMATxDesc_B2AP                      ((unsigned int)0xFFFFFFFF)  /* Buffer2 Address Pointer */

/**
  DMA Rx Desciptor
  ---------------------------------------------------------------------------------------------------------------------
  RDES0 | OWN(31) |                                             Status [30:0]                                          |
  ---------------------------------------------------------------------------------------------------------------------
  RDES1 | CTRL(31) | Reserved[30:29] | Buffer2 ByteCount[28:16] | CTRL[15:14] | Reserved(13) | Buffer1 ByteCount[12:0] |
  ---------------------------------------------------------------------------------------------------------------------
  RDES2 |                                       Buffer1 Address [31:0]                                                 |
  ---------------------------------------------------------------------------------------------------------------------
  RDES3 |                          Buffer2 Address [31:0] / Next Desciptor Address [31:0]                              |
  ----------------------------------------------------------------------------------------------------------------------
*/

/* Bit or field definition of RDES0 register (DMA Rx descriptor status register) */
#define ETH_DMARxDesc_OWN                       ((unsigned int)0x80000000)  /* OWN bit: descriptor is owned by DMA engine  */
#define ETH_DMARxDesc_AFM                       ((unsigned int)0x40000000)  /* DA Filter Fail for the rx frame  */
#define ETH_DMARxDesc_FL                        ((unsigned int)0x3FFF0000)  /* Receive descriptor frame length  */
#define ETH_DMARxDesc_ES                        ((unsigned int)0x00008000)  /* Error summary: OR of the following bits: DE || OE || IPC || LC || RWT || RE || CE */
#define ETH_DMARxDesc_DE                        ((unsigned int)0x00004000)  /* Desciptor error: no more descriptors for receive frame  */
#define ETH_DMARxDesc_SAF                       ((unsigned int)0x00002000)  /* SA Filter Fail for the received frame */
#define ETH_DMARxDesc_LE                        ((unsigned int)0x00001000)  /* Frame size not matching with length field */
#define ETH_DMARxDesc_OE                        ((unsigned int)0x00000800)  /* Overflow Error: Frame was damaged due to buffer overflow */
#define ETH_DMARxDesc_VLAN                      ((unsigned int)0x00000400)  /* VLAN Tag: received frame is a VLAN frame */
#define ETH_DMARxDesc_FS                        ((unsigned int)0x00000200)  /* First descriptor of the frame  */
#define ETH_DMARxDesc_LS                        ((unsigned int)0x00000100)  /* Last descriptor of the frame  */
#define ETH_DMARxDesc_IPV4HCE                   ((unsigned int)0x00000080)  /* IPC Checksum Error: Rx Ipv4 header checksum error   */
#define ETH_DMARxDesc_LC                        ((unsigned int)0x00000040)  /* Late collision occurred during reception   */
#define ETH_DMARxDesc_FT                        ((unsigned int)0x00000020)  /* Frame type - Ethernet, otherwise 802.3    */
#define ETH_DMARxDesc_RWT                       ((unsigned int)0x00000010)  /* Receive Watchdog Timeout: watchdog timer expired during reception    */
#define ETH_DMARxDesc_RE                        ((unsigned int)0x00000008)  /* Receive error: error reported by MII interface  */
#define ETH_DMARxDesc_DBE                       ((unsigned int)0x00000004)  /* Dribble bit error: frame contains non int multiple of 8 bits  */
#define ETH_DMARxDesc_CE                        ((unsigned int)0x00000002)  /* CRC error */
#define ETH_DMARxDesc_MAMPCE                    ((unsigned int)0x00000001)  /* Rx MAC Address/Payload Checksum Error: Rx MAC address matched/ Rx Payload Checksum Error */

/* Bit or field definition of RDES1 register */
#define ETH_DMARxDesc_DIC                       ((unsigned int)0x80000000)  /* Disable Interrupt on Completion */
#define ETH_DMARxDesc_RBS2                      ((unsigned int)0x1FFF0000)  /* Receive Buffer2 Size */
#define ETH_DMARxDesc_RER                       ((unsigned int)0x00008000)  /* Receive End of Ring */
#define ETH_DMARxDesc_RCH                       ((unsigned int)0x00004000)  /* Second Address Chained */
#define ETH_DMARxDesc_RBS1                      ((unsigned int)0x00001FFF)  /* Receive Buffer1 Size */

/* Field definition of RDES2 register */
#define ETH_DMARxDesc_B1AP                      ((unsigned int)0xFFFFFFFF)  /* Buffer1 Address Pointer */

/* Field definition of RDES3 register */
#define ETH_DMARxDesc_B2AP                      ((unsigned int)0xFFFFFFFF)  /* Buffer2 Address Pointer */

/* Timeout threshold of Reading or writing PHY registers */
#define PHY_READ_TO                             ((unsigned int)0x004FFFFF)
#define PHY_WRITE_TO                            ((unsigned int)0x0004FFFF)

/* Delay time after reset PHY */
#define PHY_ResetDelay                          ((unsigned int)0x000FFFFF)

/* Delay time after configure PHY */
#define PHY_ConfigDelay                         ((unsigned int)0x00FFFFFF)

/********************* MACCR *********************/

/* MAC watchdog enable or disable */
#define ETH_Watchdog_Enable                     ((unsigned int)0x00000000)
#define ETH_Watchdog_Disable                    ((unsigned int)0x00800000)

/* Bit description - MAC jabber enable or disable */
#define ETH_Jabber_Enable                       ((unsigned int)0x00000000)
#define ETH_Jabber_Disable                      ((unsigned int)0x00400000)

/* Value of minimum IFG between frames during transmission */
#define ETH_InterFrameGap_96Bit                 ((unsigned int)0x00000000)  /* minimum IFG between frames during transmission is 96Bit */
#define ETH_InterFrameGap_88Bit                 ((unsigned int)0x00020000)  /* minimum IFG between frames during transmission is 88Bit */
#define ETH_InterFrameGap_80Bit                 ((unsigned int)0x00040000)  /* minimum IFG between frames during transmission is 80Bit */
#define ETH_InterFrameGap_72Bit                 ((unsigned int)0x00060000)  /* minimum IFG between frames during transmission is 72Bit */
#define ETH_InterFrameGap_64Bit                 ((unsigned int)0x00080000)  /* minimum IFG between frames during transmission is 64Bit */
#define ETH_InterFrameGap_56Bit                 ((unsigned int)0x000A0000)  /* minimum IFG between frames during transmission is 56Bit */
#define ETH_InterFrameGap_48Bit                 ((unsigned int)0x000C0000)  /* minimum IFG between frames during transmission is 48Bit */
#define ETH_InterFrameGap_40Bit                 ((unsigned int)0x000E0000)  /* minimum IFG between frames during transmission is 40Bit */

/* MAC carrier sense enable or disable */
#define ETH_CarrierSense_Enable                 ((unsigned int)0x00000000)
#define ETH_CarrierSense_Disable                ((unsigned int)0x00010000)

/* MAC speed */
#define ETH_Speed_Mask                          ((unsigned int)0x00004000)

/* MAC receive own */
#define ETH_ReceiveOwn_Mask                     ((unsigned int)0x00002000)

