openwch/ch564/EVT/EXAM/SRC/Peripheral/inc/ch564_eth.h
/* MAC Duplex Mode*/
#define ETH_Duplex_Mode_Mask                    ((unsigned int)0x00000800)

/* MAC offload checksum enable or disable */
#define ETH_ChecksumOffload_Enable              ((unsigned int)0x00000400)
#define ETH_ChecksumOffload_Disable             ((unsigned int)0x00000000)

/* MAC transmission retry enable or disable */
#define ETH_RetryTransmission_Enable            ((unsigned int)0x00000000)
#define ETH_RetryTransmission_Disable           ((unsigned int)0x00000200)

/* MAC automatic pad CRC strip enable or disable */
#define ETH_AutomaticPadCRCStrip_Enable         ((unsigned int)0x00000080)
#define ETH_AutomaticPadCRCStrip_Disable        ((unsigned int)0x00000000)

/* MAC backoff limitation */
#define ETH_BackOffLimit_10                     ((unsigned int)0x00000000)
#define ETH_BackOffLimit_8                      ((unsigned int)0x00000020)
#define ETH_BackOffLimit_4                      ((unsigned int)0x00000040)
#define ETH_BackOffLimit_1                      ((unsigned int)0x00000060)

/* MAC deferral check enable or disable */
#define ETH_DeferralCheck_Enable                ((unsigned int)0x00000010)
#define ETH_DeferralCheck_Disable               ((unsigned int)0x00000000)

/********************* MACFFR *********************/

/* Bit description  : MAC receive all frame enable or disable */
#define ETH_ReceiveAll_Enable                       ((unsigned int)0x80000000)
#define ETH_ReceiveAll_Disable                      ((unsigned int)0x00000000)

/* MAC backoff limitation */
#define ETH_SourceAddrFilter_Normal_Enable          ((unsigned int)0x00000200)
#define ETH_SourceAddrFilter_Inverse_Enable         ((unsigned int)0x00000300)
#define ETH_SourceAddrFilter_Disable                ((unsigned int)0x00000000)

/* MAC Pass control frames */
#define ETH_PassControlFrames_BlockAll                ((unsigned int)0x00000040)  /* MAC filters all control frames from reaching the application */
#define ETH_PassControlFrames_ForwardAll              ((unsigned int)0x00000080)  /* MAC forwards all control frames to application even if they fail the Address Filter */
#define ETH_PassControlFrames_ForwardPassedAddrFilter ((unsigned int)0x000000C0)  /* MAC forwards control frames that pass the Address Filter. */

/* MAC broadcast frames reception */
#define ETH_BroadcastFramesReception_Enable         ((unsigned int)0x00000000)
#define ETH_BroadcastFramesReception_Disable        ((unsigned int)0x00000020)

/* MAC destination address filter */
#define ETH_DestinationAddrFilter_Normal            ((unsigned int)0x00000000)
#define ETH_DestinationAddrFilter_Inverse           ((unsigned int)0x00000008)

/* MAC Promiscuous mode enable or disable */
#define ETH_PromiscuousMode_Enable                  ((unsigned int)0x00000001)
#define ETH_PromiscuousMode_Disable                 ((unsigned int)0x00000000)

/* MAC multicast frames filter */
#define ETH_MulticastFramesFilter_PerfectHashTable      ((unsigned int)0x00000404)
#define ETH_MulticastFramesFilter_HashTable             ((unsigned int)0x00000004)
#define ETH_MulticastFramesFilter_Perfect               ((unsigned int)0x00000000)
#define ETH_MulticastFramesFilter_None                  ((unsigned int)0x00000010)

/* MAC unicast frames filter */
#define ETH_UnicastFramesFilter_PerfectHashTable        ((unsigned int)0x00000402)
#define ETH_UnicastFramesFilter_HashTable               ((unsigned int)0x00000002)
#define ETH_UnicastFramesFilter_Perfect                 ((unsigned int)0x00000000)

/* Bit description  : MAC zero quanta pause */
#define ETH_ZeroQuantaPause_Enable                      ((unsigned int)0x00000000)
#define ETH_ZeroQuantaPause_Disable                     ((unsigned int)0x00000080)

/* Field description  : MAC pause low threshold */
#define ETH_PauseLowThreshold_Minus4                    ((unsigned int)0x00000000)  /* Pause time minus 4 slot times */
#define ETH_PauseLowThreshold_Minus28                   ((unsigned int)0x00000010)  /* Pause time minus 28 slot times */
#define ETH_PauseLowThreshold_Minus144                  ((unsigned int)0x00000020)  /* Pause time minus 144 slot times */
#define ETH_PauseLowThreshold_Minus256                  ((unsigned int)0x00000030)  /* Pause time minus 256 slot times */

/* MAC unicast pause frame detect enable or disable*/
#define ETH_UnicastPauseFrameDetect_Enable              ((unsigned int)0x00000008)
#define ETH_UnicastPauseFrameDetect_Disable             ((unsigned int)0x00000000)

/* MAC receive flow control frame enable or disable */
#define ETH_ReceiveFlowControl_Enable                   ((unsigned int)0x00000004)
#define ETH_ReceiveFlowControl_Disable                  ((unsigned int)0x00000000)

/* MAC transmit flow control enable or disable */
#define ETH_TransmitFlowControl_Enable                  ((unsigned int)0x00000002)
#define ETH_TransmitFlowControl_Disable                 ((unsigned int)0x00000000)

/* MAC VLAN tag comparison */
#define ETH_VLANTagComparison_12Bit                     ((unsigned int)0x00010000)
#define ETH_VLANTagComparison_16Bit                     ((unsigned int)0x00000000)

/* MAC flag */
#define ETH_MAC_FLAG_TST                        ((unsigned int)0x00000200)  /* Time stamp trigger flag (on MAC) */
#define ETH_MAC_FLAG_MMCT                       ((unsigned int)0x00000040)  /* MMC transmit flag  */
#define ETH_MAC_FLAG_MMCR                       ((unsigned int)0x00000020)  /* MMC receive flag */
#define ETH_MAC_FLAG_MMC                        ((unsigned int)0x00000010)  /* MMC flag (on MAC) */
#define ETH_MAC_FLAG_PMT                        ((unsigned int)0x00000008)  /* PMT flag (on MAC) */

/* MAC interrupt */
#define ETH_MAC_IT_TST                          ((unsigned int)0x00000200)  /* Time stamp trigger interrupt (on MAC) */
#define ETH_MAC_IT_MMCT                         ((unsigned int)0x00000040)  /* MMC transmit interrupt */
#define ETH_MAC_IT_MMCR                         ((unsigned int)0x00000020)  /* MMC receive interrupt */
#define ETH_MAC_IT_MMC                          ((unsigned int)0x00000010)  /* MMC interrupt (on MAC) */
#define ETH_MAC_IT_PMT                          ((unsigned int)0x00000008)  /* PMT interrupt (on MAC) */

/* MAC address */
#define ETH_MAC_Address0                        ((unsigned int)0x00000000)
#define ETH_MAC_Address1                        ((unsigned int)0x00000008)
#define ETH_MAC_Address2                        ((unsigned int)0x00000010)
#define ETH_MAC_Address3                        ((unsigned int)0x00000018)

/* MAC address filter select */
#define ETH_MAC_AddressFilter_SA                ((unsigned int)0x00000000)
#define ETH_MAC_AddressFilter_DA                ((unsigned int)0x00000008)

/* MAC address mask */
#define ETH_MAC_AddressMask_Byte6               ((unsigned int)0x20000000)  /* Mask MAC Address high reg bits [15:8] */
#define ETH_MAC_AddressMask_Byte5               ((unsigned int)0x10000000)  /* Mask MAC Address high reg bits [7:0] */
#define ETH_MAC_AddressMask_Byte4               ((unsigned int)0x08000000)  /* Mask MAC Address low reg bits [31:24] */
#define ETH_MAC_AddressMask_Byte3               ((unsigned int)0x04000000)  /* Mask MAC Address low reg bits [23:16] */
#define ETH_MAC_AddressMask_Byte2               ((unsigned int)0x02000000)  /* Mask MAC Address low reg bits [15:8] */
#define ETH_MAC_AddressMask_Byte1               ((unsigned int)0x01000000)  /* Mask MAC Address low reg bits [70] */


/******************************************************************************/
/*                                                                            */
/*                          MAC Descriptor Register                                                                                                                                     */
/*                                                                            */
/******************************************************************************/

/* DMA descriptor segment */
#define ETH_DMATxDesc_LastSegment               ((unsigned int)0x40000000)  /* Last Segment */
#define ETH_DMATxDesc_FirstSegment              ((unsigned int)0x20000000)  /* First Segment */

/* DMA descriptor checksum setting */
#define ETH_DMATxDesc_ChecksumByPass            ((unsigned int)0x00000000)   /* Checksum engine bypass */
#define ETH_DMATxDesc_ChecksumIPV4Header        ((unsigned int)0x00400000)   /* IPv4 header checksum insertion  */
#define ETH_DMATxDesc_ChecksumTCPUDPICMPSegment ((unsigned int)0x00800000)   /* TCP/UDP/ICMP checksum insertion. Pseudo header checksum is assumed to be present */
#define ETH_DMATxDesc_ChecksumTCPUDPICMPFull    ((unsigned int)0x00C00000)   /* TCP/UDP/ICMP checksum fully in hardware including pseudo header */

/* DMA RX & TX buffer */
#define ETH_DMARxDesc_Buffer1                   ((unsigned int)0x00000000)  /* DMA Rx Desc Buffer1 */
#define ETH_DMARxDesc_Buffer2                   ((unsigned int)0x00000001)  /* DMA Rx Desc Buffer2 */


/******************************************************************************/
/*                                                                            */
/*                          ETH DMA Register                                                                                                                                    */
/*                                                                            */
/******************************************************************************/

