openwch/ch564/EVT/EXAM/SRC/Peripheral/inc/ch564_eth.h
/* DMA interrupt FLAG */
#define ETH_DMA_FLAG_TST                ((unsigned int)0x20000000)  /* Time-stamp trigger interrupt (on DMA) */
#define ETH_DMA_FLAG_PMT                ((unsigned int)0x10000000)  /* PMT interrupt (on DMA) */
#define ETH_DMA_FLAG_MMC                ((unsigned int)0x08000000)  /* MMC interrupt (on DMA) */
#define ETH_DMA_FLAG_DataTransferError  ((unsigned int)0x00800000)  /* Error bits 0-Rx DMA, 1-Tx DMA */
#define ETH_DMA_FLAG_ReadWriteError     ((unsigned int)0x01000000)  /* Error bits 0-write trnsf, 1-read transfr */
#define ETH_DMA_FLAG_AccessError        ((unsigned int)0x02000000)  /* Error bits 0-data buffer, 1-desc. access */
#define ETH_DMA_FLAG_NIS                ((unsigned int)0x00010000)  /* Normal interrupt summary flag */
#define ETH_DMA_FLAG_AIS                ((unsigned int)0x00008000)  /* Abnormal interrupt summary flag */
#define ETH_DMA_FLAG_ER                 ((unsigned int)0x00004000)  /* Early receive flag */
#define ETH_DMA_FLAG_FBE                ((unsigned int)0x00002000)  /* Fatal bus error flag */
#define ETH_DMA_FLAG_PHYSR              ((unsigned int)0x00000800)  /* PHY interrupt flag */
#define ETH_DMA_FLAG_ET                 ((unsigned int)0x00000400)  /* Early transmit flag */
#define ETH_DMA_FLAG_RWT                ((unsigned int)0x00000200)  /* Receive watchdog timeout flag */
#define ETH_DMA_FLAG_RPS                ((unsigned int)0x00000100)  /* Receive process stopped flag */
#define ETH_DMA_FLAG_RBU                ((unsigned int)0x00000080)  /* Receive buffer unavailable flag */
#define ETH_DMA_FLAG_R                  ((unsigned int)0x00000040)  /* Receive flag */
#define ETH_DMA_FLAG_TU                 ((unsigned int)0x00000020)  /* Underflow flag */
#define ETH_DMA_FLAG_RO                 ((unsigned int)0x00000010)  /* Overflow flag */
#define ETH_DMA_FLAG_TJT                ((unsigned int)0x00000008)  /* Transmit jabber timeout flag */
#define ETH_DMA_FLAG_TBU                ((unsigned int)0x00000004)  /* Transmit buffer unavailable flag */
#define ETH_DMA_FLAG_TPS                ((unsigned int)0x00000002)  /* Transmit process stopped flag */
#define ETH_DMA_FLAG_T                  ((unsigned int)0x00000001)  /* Transmit flag */

/* DMA interrupt */
#define ETH_DMA_IT_TST                  ((unsigned int)0x20000000)  /* Time-stamp trigger interrupt (on DMA) */
#define ETH_DMA_IT_PMT                  ((unsigned int)0x10000000)  /* PMT interrupt (on DMA) */
#define ETH_DMA_IT_MMC                  ((unsigned int)0x08000000)  /* MMC interrupt (on DMA) */
#define ETH_DMA_IT_NIS                  ((unsigned int)0x00010000)  /* Normal interrupt summary */
#define ETH_DMA_IT_AIS                  ((unsigned int)0x00008000)  /* Abnormal interrupt summary */
#define ETH_DMA_IT_ER                   ((unsigned int)0x00004000)  /* Early receive interrupt */
#define ETH_DMA_IT_FBE                  ((unsigned int)0x00002000)  /* Fatal bus error interrupt */
#define ETH_DMA_IT_PHYSR                ((unsigned int)0x00000800)  /* PHY interrupt */
#define ETH_DMA_IT_ET                   ((unsigned int)0x00000400)  /* Early transmit interrupt */
#define ETH_DMA_IT_RWT                  ((unsigned int)0x00000200)  /* Receive watchdog timeout interrupt */
#define ETH_DMA_IT_RPS                  ((unsigned int)0x00000100)  /* Receive process stopped interrupt */
#define ETH_DMA_IT_RBU                  ((unsigned int)0x00000080)  /* Receive buffer unavailable interrupt */
#define ETH_DMA_IT_R                    ((unsigned int)0x00000040)  /* Receive interrupt */
#define ETH_DMA_IT_TU                   ((unsigned int)0x00000020)  /* Underflow interrupt */
#define ETH_DMA_IT_RO                   ((unsigned int)0x00000010)  /* Overflow interrupt */
#define ETH_DMA_IT_TJT                  ((unsigned int)0x00000008)  /* Transmit jabber timeout interrupt */
#define ETH_DMA_IT_TBU                  ((unsigned int)0x00000004)  /* Transmit buffer unavailable interrupt */
#define ETH_DMA_IT_TPS                  ((unsigned int)0x00000002)  /* Transmit process stopped interrupt */
#define ETH_DMA_IT_T                    ((unsigned int)0x00000001)  /* Transmit interrupt */

/* DMA transmit process */
#define ETH_DMA_TransmitProcess_Stopped     ((unsigned int)0x00000000)  /* Stopped - Reset or Stop Tx Command issued */
#define ETH_DMA_TransmitProcess_Fetching    ((unsigned int)0x00100000)  /* Running - fetching the Tx descriptor */
#define ETH_DMA_TransmitProcess_Waiting     ((unsigned int)0x00200000)  /* Running - waiting for status */
#define ETH_DMA_TransmitProcess_Reading     ((unsigned int)0x00300000)  /* Running - reading the data from host memory */
#define ETH_DMA_TransmitProcess_Suspended   ((unsigned int)0x00600000)  /* Suspended - Tx Desciptor unavailabe */
#define ETH_DMA_TransmitProcess_Closing     ((unsigned int)0x00700000)  /* Running - closing Rx descriptor */

/* DMA receive Process */
#define ETH_DMA_ReceiveProcess_Stopped      ((unsigned int)0x00000000)  /* Stopped - Reset or Stop Rx Command issued */
#define ETH_DMA_ReceiveProcess_Fetching     ((unsigned int)0x00020000)  /* Running - fetching the Rx descriptor */
#define ETH_DMA_ReceiveProcess_Waiting      ((unsigned int)0x00060000)  /* Running - waiting for packet */
#define ETH_DMA_ReceiveProcess_Suspended    ((unsigned int)0x00080000)  /* Suspended - Rx Desciptor unavailable */
#define ETH_DMA_ReceiveProcess_Closing      ((unsigned int)0x000A0000)  /* Running - closing descriptor */
#define ETH_DMA_ReceiveProcess_Queuing      ((unsigned int)0x000E0000)  /* Running - queuing the recieve frame into host memory */

/* DMA overflow */
#define ETH_DMA_Overflow_RxFIFOCounter      ((unsigned int)0x10000000)  /* Overflow bit for FIFO overflow counter */
#define ETH_DMA_Overflow_MissedFrameCounter ((unsigned int)0x00010000)  /* Overflow bit for missed frame counter */


/*********************************************************************************
*                            Ethernet PMT defines
**********************************************************************************/

/* PMT flag */
#define ETH_PMT_FLAG_WUFFRPR      ((unsigned int)0x80000000)  /* Wake-Up Frame Filter Register Poniter Reset */
#define ETH_PMT_FLAG_WUFR         ((unsigned int)0x00000040)  /* Wake-Up Frame Received */
#define ETH_PMT_FLAG_MPR          ((unsigned int)0x00000020)  /* Magic Packet Received */

/*********************************************************************************
*                            Ethernet MMC defines
**********************************************************************************/

/* MMC TX interrupt flag */
#define ETH_MMC_IT_TGF       ((unsigned int)0x00200000)  /* When Tx good frame counter reaches half the maximum value */
#define ETH_MMC_IT_TGFMSC    ((unsigned int)0x00008000)  /* When Tx good multi col counter reaches half the maximum value */
#define ETH_MMC_IT_TGFSC     ((unsigned int)0x00004000)  /* When Tx good single col counter reaches half the maximum value */

