openwch/ch564/EVT/EXAM/SRC/Peripheral/inc/ch564_eth.h
/* ETHERNET MACMIIAR register Mask */
#define MACMIIAR_CR_MASK                ((unsigned int)0xFFFFFFE3)

/* ETHERNET MACCR register Mask */
#define MACCR_CLEAR_MASK                ((unsigned int)0xFF20810F)

/* ETHERNET MACFCR register Mask */
#define MACFCR_CLEAR_MASK               ((unsigned int)0x0000FF41)

/* ETHERNET DMAOMR register Mask */
#define DMAOMR_CLEAR_MASK               ((unsigned int)0xF8DE3F23)

/* ETHERNET Remote Wake-up frame register length */
#define ETH_WAKEUP_REGISTER_LENGTH      8

/* ETHERNET Missed frames counter Shift */
#define  ETH_DMA_RX_OVERFLOW_MISSEDFRAMES_COUNTERSHIFT     17

/* ETHERNET DMA Tx descriptors Collision Count Shift */
#define  ETH_DMATXDESC_COLLISION_COUNTSHIFT                 3

/* ETHERNET DMA Tx descriptors Buffer2 Size Shift */
#define  ETH_DMATXDESC_BUFFER2_SIZESHIFT                    16

/* ETHERNET DMA Rx descriptors Frame Length Shift */
#define  ETH_DMARXDESC_FRAME_LENGTHSHIFT                    16

/* ETHERNET DMA Rx descriptors Buffer2 Size Shift */
#define  ETH_DMARXDESC_BUFFER2_SIZESHIFT                    16

/* ETHERNET errors */
#define  ETH_ERROR              ((unsigned int)0)
#define  ETH_SUCCESS            ((unsigned int)1)


/* Bit or field definition for PHY basic control register */
#define PHY_Reset                       ((uint16_t)0x8000)      /* PHY Reset */
#define PHY_Loopback                    ((uint16_t)0x4000)      /* Select loop-back mode */
#define PHY_FULLDUPLEX_100M             ((uint16_t)0x2100)      /* Set the full-duplex mode at 100 Mb/s */
#define PHY_HALFDUPLEX_100M             ((uint16_t)0x2000)      /* Set the half-duplex mode at 100 Mb/s */
#define PHY_FULLDUPLEX_10M              ((uint16_t)0x0100)      /* Set the full-duplex mode at 10 Mb/s */
#define PHY_HALFDUPLEX_10M              ((uint16_t)0x0000)      /* Set the half-duplex mode at 10 Mb/s */
#define PHY_AutoNegotiation             ((uint16_t)0x1000)      /* Enable auto-negotiation function */
#define PHY_Restart_AutoNegotiation     ((uint16_t)0x0200)      /* Restart auto-negotiation function */
#define PHY_Powerdown                   ((uint16_t)0x0800)      /* Select the power down mode */
#define PHY_Isolate                     ((uint16_t)0x0400)      /* Isolate PHY from MII */

/* Bit or field definition for PHY basic status register */
#define PHY_AutoNego_Complete           ((uint16_t)0x0020)      /* Auto-Negotioation process completed */
#define PHY_Linked_Status               ((uint16_t)0x0004)      /* Valid link established */
#define PHY_Jabber_detection            ((uint16_t)0x0002)      /* Jabber condition detected */
#define PHY_RMII_Mode                   ((uint16_t)0x0020)      /* RMII */


/* PHY basic register */
#define PHY_BCR                         0x0           /*PHY transceiver Basic Control Register */
#define PHY_BSR                         0x01          /*PHY transceiver Basic Status Register*/
#define PHY_BMCR                        PHY_BCR
#define PHY_BMSR                        PHY_BSR
#define PHY_PHYIDR1                     0x02          /*PHY Identifier Register*/
#define PHY_PHYIDR2                     0x03          /*PHY Identifier Register*/
#define PHY_ANAR                        0x04          /* Auto-Negotiation Advertisement Register */
#define PHY_ANLPAR                      0x05          /* Auto-Negotiation Link Partner Base  Page Ability Register*/
#define PHY_ANER                        0x06          /* Auto-Negotiation Expansion Register */
#define PHY_ANNPTR                      0x07
#define PHY_ANLPNPR                     0x08
#define PHY_PAG_SEL                     0x1F

/****************Page 0********************/
#define PHY_MMD_CONTROL                 0x0D
#define PHY_MMD_ADDR                    0x0E
#define PHY_FLASE_CAR_CNT               0x14
#define PHY_RECV_ERR_CNT                0x15
#define PHY_PWR_SAVE                    0x18
#define PHY_CONTROL1                    0x19
#define PHY_STATUS1                     0x1A
#define PHY_ADDR                        0x1B
#define PHY_MDI_MDIX                    0x1C
#define PHY_INTERRUPT_IND               0x1E

/****************Page 4********************/
#define PHY_EEE_CAP0                    0x10
#define PHY_EEE_CAP1                    0x15
#define PHY_CRC_DET                     0x17
#define PHY_RX_CRCERR_CNT               0x18
#define PHY_RX_PACKET_CNT               0x19
#define PHY_BT100_ANA                   0x1A

/****************Page 7********************/
#define PHY_EEEPC1R                     0x00
#define PHY_EEEPS1R                     0x01
#define PHY_EEECR                       0x14
#define PHY_EEEWER                      0x16
#define PHY_EEEAR                       0x3C
#define PHY_EEELPAR                     0x3D

#define PHY_CUST_LED_SET                0x11
#define PHY_EEE_LED_EN                  0x12
#define PHY_INTERRUPT_MASK              0x13
#define PHY_LED_CONTROL                 0x15

/****************Page 8********************/
#define PHY_WKUPF_MASK0                 0x10
#define PHY_WKUPF_MASK1                 0x11
#define PHY_WKUPF_MASK2                 0x12
#define PHY_WKUPF_MASK3                 0x13
#define PHY_WKUPF_MASK4                 0x14
#define PHY_WKUPF_MASK5                 0x15
#define PHY_WKUPF_MASK6                 0x16
#define PHY_WKUPF_MASK7                 0x17

/****************Page 16********************/
#define PHY_WKCRC0                      0x10

/****************Page 17********************/
#define PHY_WOL_ABILITY                 0x10
#define PHY_WOL_RESET                   0x11
#define PHY_WOL_ISO_PMEB                0x13
#define PHY_WOL_CTRL_SET                0x14
#define PHY_WOL_STATUS                  0x15
#define PHY_WOL_PA_DBYTE0               0x16
#define PHY_WOL_PA_DBYTE1               0x17
#define PHY_WOL_PA_DBYTE2               0x18

/****************Page 18********************/
#define PHY_UNI_PHY_ADDR0               0x10
#define PHY_UNI_PHY_ADDR1               0x11
#define PHY_UNI_PHY_ADDR2               0x12
#define PHY_MULTICAST0                  0x13
#define PHY_MULTICAST1                  0x14
#define PHY_MULTICAST2                  0x15
#define PHY_MULTICAST3                  0x16

#define PHY_REG_PAGE0                   0x00
#define PHY_REG_PAGE4                   0x04
#define PHY_REG_PAGE7                   0x07
#define PHY_REG_PAGE8                   0x08
#define PHY_REG_PAGE16                  0x10
#define PHY_REG_PAGE17                  0x11
#define PHY_REG_PAGE18                  0x12

/***************INTERRUPT_IND******************/
#define INTERRUPT_AUTO_NEGOTIATION_ERR      ((uint16_t)0x8000)
#define INTERRUPT_SPEED_CHANGE              ((uint16_t)0x4000)
#define INTERRUPT_DUPLEX_CHANGE             ((uint16_t)0x2000)
#define INTERRUPT_LINK_CHANGE               ((uint16_t)0x0800)
#define INTERRUPT_WOL_DONE                  ((uint16_t)0x0001)

/***************PHY_WOL_STATUS******************/
#define WOL_DONE_INT                  ((uint16_t)0x0001)

void  ETH_Start(void);

void printf_dmasr (void);

void ETH_DropRxPkt(void);

void print_dmasr_rps(void);

