openwch/ch564/EVT/EXAM/SRC/Peripheral/inc/ch564_eth.h
void print_dmasr_tps(void);

void print_dmasr_tbus(void);

void ETH_SoftwareReset(void);

uint32_t ETH_GetRxPktSize(void);

void ETH_MMCCountersReset(void);

void ETH_FlushTransmitFIFO(void);

void delay_clk (uint32_t nCount);

void ETH_ResumeDMAReception(void);

FlagStatus ETH_GetlinkStaus (void);

void ETH_ResumeDMATransmission(void);

uint32_t ETH_HandleRxPkt(uint8_t *ppkt);

void ETH_InitiatePauseControlFrame(void);

uint32_t ETH_GetReceiveProcessState(void);

uint32_t ETH_GetTransmitProcessState(void);

FlagStatus ETH_GetSoftwareResetStatus(void);

uint32_t ETH_GetCurrentTxBufferAddress(void);

uint32_t ETH_GetCurrentRxBufferAddress(void);

void ETH_DMAClearFlag(uint32_t ETH_DMA_FLAG);

FlagStatus ETH_GetFlowControlBusyStatus(void);

uint32_t ETH_GetCurrentTxDescStartAddress(void);

uint32_t ETH_GetCurrentRxDescStartAddress(void);

FlagStatus ETH_GetFlushTransmitFIFOStatus(void);

void ETH_PowerDownCmd(FunctionalState NewState);

ITStatus ETH_GetMMCITStatus(uint32_t ETH_MMC_IT);

uint32_t ETH_GetMMCRegister(uint32_t ETH_MMCReg);

ITStatus ETH_GetMACITStatus(uint32_t ETH_MAC_IT);

ITStatus ETH_GetDMAITStatus(uint32_t ETH_DMA_IT);

void ETH_MACReceptionCmd(FunctionalState NewState);

void ETH_DMAClearITPendingBit(uint32_t ETH_DMA_IT);

void ETH_DMAReceptionCmd(FunctionalState NewState);

uint32_t ETH_GetRxOverflowMissedFrameCounter(void);

void ETH_MMCResetOnReadCmd(FunctionalState NewState);

void ETH_ResetWakeUpFrameFilterRegisterPointer(void);

void ETH_StructInit(ETH_InitTypeDef* ETH_InitStruct);

void ETH_MACTransmissionCmd(FunctionalState NewState);

void ETH_DMATransmissionCmd(FunctionalState NewState);

void ETH_MMCCounterFreezeCmd(FunctionalState NewState);

FlagStatus ETH_GetDMAFlagStatus(uint32_t ETH_DMA_FLAG);

FlagStatus ETH_GetMACFlagStatus(uint32_t ETH_MAC_FLAG);

FlagStatus ETH_GetPMTFlagStatus(uint32_t ETH_PMT_FLAG);

void ETH_SetWakeUpFrameFilterRegister(uint32_t *Buffer);

void ETH_GetMACAddress(uint32_t MacAddr, uint8_t *Addr);

void ETH_MMCCounterRolloverCmd(FunctionalState NewState);

void ETH_GlobalUnicastWakeUpCmd(FunctionalState NewState);

uint32_t ETH_GetBufferUnavailableMissedFrameCounter(void);

void ETH_WakeUpFrameDetectionCmd(FunctionalState NewState);

void ETH_MagicPacketDetectionCmd(FunctionalState NewState);

void ETH_SetDMATxDescOwnBit(ETH_DMADESCTypeDef *DMATxDesc);

void ETH_MACAddressConfig(uint32_t MacAddr, uint8_t *Addr);

void ETH_SetDMARxDescOwnBit(ETH_DMADESCTypeDef *DMARxDesc);

void ETH_BackPressureActivationCmd(FunctionalState NewState);

uint32_t ETH_HandleTxPkt(uint8_t *ppkt, uint16_t FrameLength);

FlagStatus ETH_GetDMAOverflowStatus(uint32_t ETH_DMA_Overflow);

uint32_t ETH_HandlePTPRxPkt(uint8_t *ppkt, uint32_t *PTPRxTab);

void RGMII_TXC_Delay(uint8_t clock_polarity,uint8_t delay_time);

void ETH_MACAddressFilterConfig(uint32_t MacAddr, uint32_t Filter);

uint16_t ETH_ReadPHYRegister(uint16_t PHYAddress, uint16_t PHYReg);

void ETH_DMAITConfig(uint32_t ETH_DMA_IT, FunctionalState NewState);

void ETH_MACITConfig(uint32_t ETH_MAC_IT, FunctionalState NewState);

uint32_t ETH_GetDMARxDescFrameLength(ETH_DMADESCTypeDef *DMARxDesc);

void ETH_MMCITConfig(uint32_t ETH_MMC_IT, FunctionalState NewState);

uint32_t ETH_GetDMATxDescCollisionCount(ETH_DMADESCTypeDef *DMATxDesc);

uint32_t ETH_PHYLoopBackCmd(uint16_t PHYAddress, FunctionalState NewState);

void ETH_MACAddressMaskBytesFilterConfig(uint32_t MacAddr, uint32_t MaskByte);

void ETH_MACAddressPerfectFilterCmd(uint32_t MacAddr, FunctionalState NewState);

void ETH_DMATxDescCRCCmd(ETH_DMADESCTypeDef *DMATxDesc, FunctionalState NewState);

uint32_t ETH_HandlePTPTxPkt(uint8_t *ppkt, uint16_t FrameLength, uint32_t *PTPTxTab);

uint32_t ETH_WritePHYRegister(uint16_t PHYAddress, uint16_t PHYReg, uint16_t PHYValue);

void ETH_DMATxDescEndOfRingCmd(ETH_DMADESCTypeDef *DMATxDesc, FunctionalState NewState);

void ETH_DMATxDescTimeStampCmd(ETH_DMADESCTypeDef *DMATxDesc, FunctionalState NewState);

void ETH_DMARxDescEndOfRingCmd(ETH_DMADESCTypeDef *DMARxDesc, FunctionalState NewState);

void ETH_DMARxDescReceiveITConfig(ETH_DMADESCTypeDef *DMARxDesc, FunctionalState NewState);

void ETH_DMATxDescTransmitITConfig(ETH_DMADESCTypeDef *DMATxDesc, FunctionalState NewState);

uint32_t ETH_GetDMARxDescBufferSize(ETH_DMADESCTypeDef *DMARxDesc, uint32_t DMARxDesc_Buffer);

void ETH_DMATxDescShortFramePaddingCmd(ETH_DMADESCTypeDef *DMATxDesc, FunctionalState NewState);

FlagStatus ETH_GetDMATxDescFlagStatus(ETH_DMADESCTypeDef *DMATxDesc, uint32_t ETH_DMATxDescFlag);

FlagStatus ETH_GetDMARxDescFlagStatus(ETH_DMADESCTypeDef *DMARxDesc, uint32_t ETH_DMARxDescFlag);

void ETH_DMATxDescSecondAddressChainedCmd(ETH_DMADESCTypeDef *DMATxDesc, FunctionalState NewState);

void ETH_DMARxDescSecondAddressChainedCmd(ETH_DMADESCTypeDef *DMARxDesc, FunctionalState NewState);

void ETH_DMATxDescChainInit(ETH_DMADESCTypeDef *DMATxDescTab, uint8_t *TxBuff, uint32_t TxBuffCount);

void ETH_DMATxDescFrameSegmentConfig(ETH_DMADESCTypeDef *DMATxDesc, uint32_t DMATxDesc_FrameSegment);

void ETH_DMARxDescChainInit(ETH_DMADESCTypeDef *DMARxDescTab, uint8_t *RxBuff, uint32_t RxBuffCount);

void ETH_DMATxDescChecksumInsertionConfig(ETH_DMADESCTypeDef *DMATxDesc, uint32_t DMATxDesc_Checksum);

void ETH_DMATxDescBufferSizeConfig(ETH_DMADESCTypeDef *DMATxDesc, uint32_t BufferSize1, uint32_t BufferSize2);

void ETH_DMATxDescRingInit(ETH_DMADESCTypeDef *DMATxDescTab, uint8_t *TxBuff1, uint8_t *TxBuff2, uint32_t TxBuffCount);

void ETH_DMARxDescRingInit(ETH_DMADESCTypeDef *DMARxDescTab, uint8_t *RxBuff1, uint8_t *RxBuff2, uint32_t RxBuffCount);

void ETH_InitializePTPTimeStamp(void);

void ETH_EnablePTPTimeStampAddend(void);

void ETH_EnablePTPTimeStampUpdate(void);

void ETH_SetPTPTimeStampAddend(uint32_t Value);

uint32_t ETH_GetPTPRegister(uint32_t ETH_PTPReg);

void ETH_EnablePTPTimeStampInterruptTrigger(void);

void ETH_PTPTimeStampCmd(FunctionalState NewState);

void ETH_PTPUpdateMethodConfig(uint32_t UpdateMethod);

FlagStatus ETH_GetPTPFlagStatus(uint32_t ETH_PTP_FLAG);

void ETH_SetPTPSubSecondIncrement(uint32_t SubSecondValue);

void ETH_SetPTPTargetTime(uint32_t HighValue, uint32_t LowValue);

void ETH_SetPTPTimeStampUpdate(uint32_t Sign, uint32_t SecondValue, uint32_t SubSecondValue);

void ETH_DMAPTPTxDescChainInit(ETH_DMADESCTypeDef *DMATxDescTab, ETH_DMADESCTypeDef *DMAPTPTxDescTab, uint8_t* TxBuff, uint32_t TxBuffCount);

void ETH_DMAPTPRxDescChainInit(ETH_DMADESCTypeDef *DMARxDescTab, ETH_DMADESCTypeDef *DMAPTPRxDescTab, uint8_t *RxBuff, uint32_t RxBuffCount);



#ifdef __cplusplus
}
#endif

#endif

